<template>
<div class="web">
  <div class="container">
    <div class="title">
      <text v-if="x == 0">WHO ARE YOU, WARRIOR?</text>
      <text v-if="x != 0" class="submit" 
        @click="setCharacter(characters[x].id, characters[x].name)">LETS START {{characters[x].name}}!
      </text>
    </div>
    <div class="choosing">
      <div class="left-warriors-list">
        <CardCharacter 
          v-for="char in characters" :key="char"
          :desc="char.title + '?'" 
          :pic="link + char.id + '.jpg'" 
          @click="x = char.numId" 
        />
      </div>
      <div class="right-warriors-desc">
        <div class="war-title-and-pic">
          <div class="war-pic">
            <img :src="link + characters[x].id + '.jpg'">
            <div class="war-title">
              <text v-html="characters[x].title"></text>&nbsp;
              <text v-if="x != 0">{{ characters[x].name }}</text>
            </div>
          </div>
        </div>
        <div class="war-desc">
          <div class="war-desc-styles" v-html="characters[x].description"></div>
        </div>
      </div>
    </div>
  </div>
</div>
</template>
<script>
import CardCharacter from '../components/CardTochka.vue';
import { socket } from '@/socket'
export default{
  components:{
    CardCharacter,
  },
  data(){
    return{
      x: 0,
      link: 'http://5.42.73.140/',
      characters:[
        {
          numId: 0,
          id: 'choose',
          name: 'Main',
          title: 'CHOOSE YOUR WARRIOR CHARACTER AND GO ON AN ADVENTURE.<br /><b>MAY ODEN KEEP YOU SAFE!</b>',
          description: '<b>Предыстория великих войнов "Покура":</b> <br /> <b>&nbsp;В далеком мире Покура</b> существовала древняя империя, известная своей мощью и воинскими традициями. В этой империи жили различные племена, каждое из которых имело своего воина-легенду, способного противостоять любым врагам.<br /><b>&nbsp;Одним</b> из таких племен были Покуры - народ, известный своей жестокостью и воинским мастерством. Они были непобедимыми в битвах и считались самыми опасными воинами во всем мире Покура. Их главным богом был Саня - неустрашимый и беспощадный агро-воин.<br /><b>&nbsp;Саня</b> рос среди своего племени, обучаясь искусству войны и усиливая свою физическую силу и навыки. Он был необычайно талантливым и быстро стал одним из лучших воинов своего племени. Его решимость и ярость в битве были безграничными, и он всегда стремился к победе независимо от цены.<br /><b>&nbsp;Однажды</b>, великая империя Покура оказалась под угрозой. Вражеское племя, желающее завоевать и уничтожить Покуры, собиралось нанести им смертельный удар. Саня, осознавая опасность, предложил своему племени возглавить армию и сразиться с врагом.<br /><b>&nbsp;В битве</b>, которая развернулась, Саня проявил свою неукротимость и разрушительную силу. Он во главе своей армии прорывался сквозь ряды врагов, нанося сокрушительные удары и вызывая хаос на поле боя. Его присутствие наполняло сердца его союзников мужеством, а противников страхом.<br /><b>&nbsp;В конечном итоге</b>, благодаря Сане и его агрессивной стратегии, Покуры одержали победу над врагом. Это стало поворотным моментом в истории Покуры, и Саня стал легендой среди своего народа. После победы над врагами, Саня продолжал служить своему племени и стал символом мощи и ярости. Его имя стало известно во всем мире Покура, и его легенда жила в сердцах воинов, вдохновляя их на подвиги и победы.<br /><b>&nbsp;Таким</b> образом, предыстория великих войнов "Покура" описывает Саню как неустрашимого и беспощадного агро-воина, который смог противостоять любым преградам и привести свое племя к победе. Его сила, ярость и решимость стали символом мощи и разрушения в мире Покура.'
        },
        {
          numId: 1,
          id: 'a38f9dd3-263f-4f64-9314-b6e171fe5b75',
          name: 'Felix',
          title: 'Задумчивый шаман',
          description: '<b>Феликс</b> - мудрый и загадочный шаман, который всегда глубоко задумчив. Его глаза, полные мудрости и тайны, отражают бесконечную проницательность его души. Он обладает уникальной способностью видеть и понимать глубинные энергии и силы природы. <br /><b>&nbsp;В своем облике</b> Феликс выглядит как старый древний дуб, с мощными корнями, проникающими глубоко в землю и могучими ветвями, стремящимися к небесам. Его одежда состоит из натуральных материалов и украшена символами, отражающими его связь с природой и духовным миром. <br /><b>&nbsp;Шаман Феликс</b> проводит свое время в медитации и контакте с духами природы. Он обладает уникальной способностью лечить и помогать другим, используя знания и энергию, полученную от духов и элементов природы. Его голос, наполненный мелодичностью и трансцендентными звуками, способен проникнуть в самые глубины души и вызвать исцеляющие вибрации. <br /><b>&nbsp;Феликс</b> - человек мало слов, но его молчаливая присутствие и мудрость оказывают глубокое влияние на окружающих. Он всегда готов выслушать и помочь тем, кто ищет духовное просветление и истинную гармонию. <br /><b>&nbsp;Шаман Феликс</b> является проводником между мирами, соединяя духовную сферу с материальным миром. Его присутствие наполняет пространство энергией и спокойствием, принося равновесие и гармонию в сердца и души тех, кто обращается к нему. <br /><b>&nbsp;Феликс</b> - это символ мудрости, силы и внутреннего покоя. Его душа горит ярким огнем знания и понимания, а его сердце открыто для всех, кто ищет поддержку и руководство на пути к истинной гармонии и счастью.'
        },
        {
          numId: 2,
          id: 'f786b04d-5388-413c-83c9-dcf8c88b885e',
          name: 'Anton',
          title: 'Танчащий палладин',
          description: '<b>Антон</b> - непоколебимый и преданный праведный паладин, чья сила и верность светлым принципам не знают границ. Он является воплощением добра и справедливости, всегда готов защищать слабых и бороться со злом. <br /><b>&nbsp;В своей броне</b>, украшенной символами света и добродетелей, Антон выглядит как неприступная стена, готовая противостоять любым испытаниям. Его меч, олицетворяющий силу и справедливость, всегда готов мчаться в бой, чтобы наказать злодеев и защитить невинных. <br /><b>&nbsp;Антон</b> - идеал чести и доблести. Он следует кодексу рыцарства, почитает справедливость и помогает тем, кто нуждается в защите. Его решительность и отвага вдохновляют окружающих и подают пример того, каким должен быть истинный герой. <br /><b>&nbsp;Праведный паладин Антон</b> обладает способностью использовать световую магию для лечения ран и изгнания злых сил. Его благословение способно снять проклятия и подарить новую надежду тем, кто оказался в безвыходной ситуации. Его присутствие наполняет окружающих чувством безопасности и уверенности в победе над злом. <br /><b>&nbsp;Антон</b> - готовый отдать свою жизнь за защиту других. Он всегда стоит на переднем крае битвы, готовый сражаться до последнего вздоха. Его преданность и самоотверженность делают его не только мощным воином, но и истинным лидером, способным вдохновить и объединить других в борьбе за добро. <br /><b>&nbsp;Антон</b> - символ надежды и спасения. Его присутствие приносит свет и освобождение от тьмы, даруя миру мир и справедливость. Он является опорой для всех, кто нуждается в помощи и руководстве на пути к благородству и истинной свободе.'
        },
        {
          numId: 3,
          id: '07dd2448-4e50-4d77-acb2-29a0ab9aa2d4',
          name: 'Danil',
          title: 'Длинный убийца',
          description: '<b>Даниил</b> - таинственный и беспощадный дальний убийца, чья мастерская сноровка и хладнокровие не знают границ. Он является воплощением теней и незаметности, всегда готов проникнуть в самое сердце врагов и нанести смертельный удар. <br /><b>&nbsp;В своей темной одежде</b>, украшенной символами скрытности и смерти, Даниил выглядит как призрак, готовый проникнуть незаметно и навсегда исчезнуть. Его лук, олицетворяющий точность и смертоносность, всегда натянут и готов стрелять смертоносными стрелами, чтобы уничтожить своих врагов издалека. <br /><b>&nbsp;Даниил</b> - идеал безжалостности и непреклонности. Он следует своему собственному кодексу, почитает силу и страх перед ним. Его хладнокровие и мастерство вдохновляют его союзников и пугают его противников, подавая пример того, каким должен быть настоящий ассасин. <br /><b>&nbsp;Дальний убийца Даниил</b> обладает способностью использовать магию теней для скрытного передвижения и нанесения смертельных ударов. Его ловкость и незаметность позволяют ему проникать в самые охраняемые места и устранять своих врагов, не оставляя следов. Его присутствие наполняет окружающих чувством тревоги и неизбежности гибели. <br /><b>&nbsp;Даниил</b> - готовый уничтожить любого, кто станет на его пути. Он всегда действует издалека, готовый нанести смертельный удар безжалостно и беспощадно. Его безразличие и безупречное мастерство делают его не только смертоносным убийцей, но и опасным противником, способным уничтожить любого, кто попытается ему противостоять. <br /><b>&nbsp;Даниил</b> - символ страха и безмолвия. Его присутствие приносит тьму и смерть, даруя миру страх и ужас. Он является угрозой для всех, кто станет на его пути и несет с собой непредсказуемость и опасность.'
        },
        {
          numId: 4,
          id: '4dfd4089-0d29-43ee-acda-7cee22a59bf8',
          name: 'Ruslan',
          title: 'Таинственный маг',
          description: '<b>Руслан</b> - загадочный и могущественный маг, чьи способности и знания в области магии не имеют границ. Он является воплощением тайны и непостижимости, всегда готов раскрыть древние секреты и использовать свою магию для достижения своих целей. <br /><b>&nbsp;В своей одежде</b>, украшенной символами магии и мистики, Руслан выглядит как стражник запретных знаний, готовый раскрыть великие тайны вселенной. Его посох, олицетворяющий его магическую силу и мудрость, всегда готов испустить потоки энергии и вызвать разрушительные заклинания, чтобы противостоять своим врагам. <br /><b>&nbsp;Руслан</b> - идеал загадочности и непредсказуемости. Он следует своим собственным принципам и стремится к познанию запретных знаний. Его мудрость и мастерство вдохновляют его союзников и пугают его противников, подавая пример того, каким должен быть настоящий маг. <br /><b>&nbsp;Маг</b> Руслан обладает способностью использовать магию элементов и вызывать мощные заклинания. Его сила и контроль над магическими силами позволяют ему управлять огнем, водой, воздухом и землей, создавая разрушительные эффекты и обращая силы природы в свою пользу. Его присутствие наполняет окружающих чувством благоговения и неизбежности силы магии. <br /><b>&nbsp;Руслан</b> - готовый использовать свою магию для достижения своих целей. Он всегда действует с превосходством, готовый применить мощные заклинания без колебаний и сомнений. Его непоколебимость и непревзойденное мастерство делают его не только опасным магом, но и великим защитником, способным противостоять любым угрозам. <br /><b>&nbsp;Руслан</b> - символ тайны и мощи. Его присутствие приносит загадку и величие, даруя миру возможность увидеть истинную силу магии. Он является угрозой для всех, кто станет на его пути и несет с собой непостижимость и непредсказуемость.'
        },
        {
          numId: 5,
          id: 'a14ae894-32f0-4be5-9d54-d58333e7f3fc',
          name: 'Sanya',
          title: 'Агро воин',
          description: '<b>Саня</b> - неустрашимый и беспощадный агро-воин, чья сила и жестокость не знают границ. Он является воплощением ярости и разрушения, всегда готов расправиться с врагами и использовать свою силу для достижения своих целей. <br /><b>&nbsp;В своей боевой экипировке</b>, украшенной шрамами и следами битв, Саня выглядит как настоящий воин, готовый вступить в смертельный поединок с любым противником. Его оружие, олицетворяющее его силу и решимость, всегда готово нанести сокрушительные удары и вызвать хаос на поле боя, чтобы покорить своих врагов. <br /><b>&nbsp;Саня</b> - идеал агрессии и неукротимости. Он следует своим собственным правилам и стремится к победе в любой ценой. Его ярость и мастерство вдохновляют его союзников и заполняют сердца его противников страхом, подавая пример того, каким должен быть настоящий агро-воин. <br /><b>&nbsp;Агро-воин Саня</b> обладает способностью использовать свою ярость и силу для нанесения сокрушительных ударов. Его неистовство и контроль над боевыми навыками позволяют ему разрушать преграды и противостоять любым препятствиям, создавая хаос и обращая его в свою пользу. Его присутствие на поле боя наполняет окружающих чувством страха и неизбежности поражения. <br /><b>&nbsp;Саня</b> - готов использовать свою силу для достижения своих целей. Он всегда действует с яростью и безжалостностью, готовый нанести сокрушительные удары без колебаний и сомнений. Его неустрашимость и беспощадность делают его не только опасным агро-воином, но и непобедимым защитником, способным сокрушить любые преграды. <br /><b>&nbsp;Саня</b> - символ ярости и мощи. Его присутствие приносит разрушение и ужас, даруя миру возможность увидеть истинную силу агрессии. Он является угрозой для всех, кто станет на его пути и несет с собой неукротимость и разрушение.'
        },
      ],
      // socketswhoiswho:[],
    }
  },
  methods:{
    setCharacter(id, whois){
      socket.emit("login" , {userId : `${id}`, isLogin: true})
      socket.on("login", (data) => {
        socket.emit("list");
        if(data.isLogin){
          localStorage.setItem('id', `${data.id}`)
          localStorage.setItem('whois', `${whois}`)
          localStorage.setItem('role', `${data.name}`)
          this.$router.push('/main')
        }
      })
    }
  },
  // mounted(){
  //   socket.on("list", (data) => {
  //     console.log(data);
  //     if (this.socketswhoiswho.length == 0){
  //       for (let i=0; i<data.length; i++){
  //         if (data[i].name != this.role){
  //           this.socketswhoiswho.push(data[i]);
  //         }
  //       }
  //     } else {
  //       for (let i=0; i<this.socketswhoiswho.length; i++){
  //         this.socketswhoiswho[i].isLogin = data[i].isLogin;
  //       }
  //     }
  //   });
  // }
}
</script>
<style scoped>
.web{
  width: 100vw;
  height: 100vh;
  display: flex;
  justify-content: center;
  align-items: center;
}
.container{
  width: 90vw;
  /* height: 90vh; */
  border: 2px solid gray;
  background-color: lightgray;
  border-radius: 1.2rem;
  padding: 1vw;
  display: flex;
  flex-direction: column;
  position: relative;
  /* justify-content: space-between; */
}


/*TITLE*/
.title{
  width: 100%;
  text-align: center;
  font-size: 2vw;
  font-weight: bold;
  position: relative;

}
.submit:hover{
  color: darkred;
  cursor: pointer;
}


/*CHOOSING*/
.choosing{
  margin-top: 1vw;
  display: flex;
  flex-direction: row;
  height: 85vh;
}
/*cards*/
.left-warriors-list{
  overflow-y: scroll;
  width: 15vw;
  margin-right: 1vw;
  scrollbar-width: none;
  
}
/* .left-warriors-list::-webkit-scrollbar {
    display: none;
} */
/*desc cards*/
.right-warriors-desc{
  width: 80vw;
  display: flex;
  flex-direction: row;
  justify-content: center;
  align-items: center;
}
.war-title-and-pic{
  width: 35%;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
}
.war-title{
  position: absolute;
  bottom: 10vw;
  text-align: center;
  padding: 5%;
  width: 90%;
  font-size: 1.5vw;
  color: white;
  backdrop-filter: blur(10px);
}
.war-pic{
  width: 100%;
  height: 40vw;
  position: relative;
}
.war-pic img{
  width: 100%;
  height: 100%;
  border-radius: 1.5rem;
}
.war-desc{
  width: 60%;
  padding: 1vw;
}
.war-desc-styles{
  padding: 1vw;
  background-color: bisque;
  border-radius: 1.5rem;
  border: 1px solid gray;
  height: 36vw;
  font-size: 1vw;
}
</style>